indexxue/TM4C123GH6PM/projects/rc-controller/main/app.c
/**
 * @file    app.c
 * @brief   遥控器应用：摇杆校准/菜单 UI + 蓝牙 DRIVE
 */

#include "app.h"

#include "joy_cal.h"
#include "joystick.h"
#include "lcd_panel.h"
#include "nrf24.h"
#include "rc_ui.h"

#include "attitude.h"
#include "battery.h"
#include "board.h"
#include "device_profile.h"
#include "event.h"
#include "imu.h"
#include "led_scene.h"
#include "log.h"
#include "nvs.h"
#include "proto_client.h"

#include "FreeRTOS.h"
#include "task.h"

/** 磁力计未焊接时置 0 */
#define RC_MAG_ENABLE               0

#if RC_MAG_ENABLE
#include "magnetometer.h"
#endif

#define RC_TASK_PRIO_EVT            (3U)
#define RC_TASK_PRIO_TMR            (4U)

#define RC_EVT_STACK_WORDS          (1280U)
#define RC_TMR_STACK_WORDS          (256U)

#define RC_CTRL_PERIOD_MS           (20U)
#define RC_LED_SCENE_TICK_MS        (50U)
#define RC_SENSOR_RETRY_MS          (1000U)
#define RC_ATT_SAMPLE_HZ            (50.0f)

static TaskHandle_t s_evt_task;
static TaskHandle_t s_tmr_task;

static bool_t s_imu_ready;
#if RC_MAG_ENABLE
static bool_t s_mag_ready;
#endif
static uint16_t s_sensor_retry_ms;

static void rc_peripherals_init(void)
{
    if (device_profile_board_wants(DEVICE_BOARD_MASK_JOYSTICK)) {
        if (board_joystick_init() != STATUS_OK) {
            LOG_WARN("rc: joystick adc init fail");
        }
    }

    if (joy_cal_init() != STATUS_OK) {
        LOG_WARN("rc: joy_cal init fail");
    }

    if (device_profile_board_wants(DEVICE_BOARD_MASK_NRF24)) {
        board_nrf24_gpio_init();
        LOG_INFO("rc: nrf gpio ready (driver TBD)");
    }
}

static void rc_sensors_try_init(void)
{
    if (device_profile_board_wants(DEVICE_BOARD_MASK_IMU) && !s_imu_ready) {
        s_imu_ready = (imu_init() == STATUS_OK) ? TRUE : FALSE;
        if (s_imu_ready) {
            LOG_INFO("rc: imu ready");
        }
    }
#if RC_MAG_ENABLE
    if (device_profile_board_wants(DEVICE_BOARD_MASK_MAG) && !s_mag_ready) {
        s_mag_ready = (magnetometer_init() == STATUS_OK) ? TRUE : FALSE;
        if (s_mag_ready) {
            LOG_INFO("rc: mag ready");
        }
    }
    if (s_imu_ready && s_mag_ready) {
        (void)attitude_init(RC_ATT_SAMPLE_HZ);
    }
#endif
}

static void rc_on_timer(void)
{
    proto_client_tick(RC_CTRL_PERIOD_MS);

    rc_ui_tick(RC_CTRL_PERIOD_MS);

    if (device_profile_board_wants(DEVICE_BOARD_MASK_JOYSTICK)) {
        if (rc_ui_drive_muted()) {
            (void)proto_client_send_drive(0, 0);
        } else {
            (void)proto_client_send_drive(rc_ui_last_throttle(), rc_ui_last_steer());
        }
    }

    if (s_sensor_retry_ms < RC_SENSOR_RETRY_MS) {
        s_sensor_retry_ms = (uint16_t)(s_sensor_retry_ms + RC_CTRL_PERIOD_MS);
    } else {
        s_sensor_retry_ms = 0U;
        rc_sensors_try_init();
    }
}

static void rc_evt_task_fn(void *arg)
{
    (void)arg;

    log_notify_scheduler_running();
    (void)log_set_level(LOG_LEVEL_INFO);

    if (nvs_init() != STATUS_OK) {
        LOG_WARN("rc: nvs_init fail (cal will use defaults)");
    }

    rc_peripherals_init();

    if (device_profile_board_wants(DEVICE_BOARD_MASK_LCD)) {
        if (lcd_panel_init() == STATUS_OK) {
            (void)rc_ui_init();
        } else {
            LOG_WARN("rc: lcd init fail");
        }
    }

    rc_sensors_try_init();

    if (device_profile_board_wants(DEVICE_BOARD_MASK_BATTERY)) {
        battery_init();
    }

    if (device_profile_board_wants(DEVICE_BOARD_MASK_LED)) {
        led_scene_init();
        led_scene_run(LED_SCENE_ID_BOOTUP);
    }

    event_set(EVT_ID_TIMER);
    LOG_INFO("rc: ui ready mode=HOME (hold JS2 for menu)");

    for (;;) {
        event_schedule();

        if (event_is_set(EVT_ID_TIMER)) {
            rc_on_timer();
        }
    }
}

static void rc_tmr_task_fn(void *arg)
{
    uint32_t led_ms = 0U;

    (void)arg;

    for (;;) {
        vTaskDelay(pdMS_TO_TICKS(RC_CTRL_PERIOD_MS));
        event_set(EVT_ID_TIMER);

        led_ms += RC_CTRL_PERIOD_MS;
        if (led_ms >= RC_LED_SCENE_TICK_MS) {
            led_ms = 0U;
            if (device_profile_board_wants(DEVICE_BOARD_MASK_LED) && led_scene_is_active()) {
                led_scene_update();
            }
        }
    }
}

status_t App_Start(void)
{
    if (event_init() != STATUS_OK) {
        LOG_ERROR("rc: event_init fail");
        return STATUS_FAIL;
    }

    (void)proto_client_init();
    (void)proto_client_send_hello();

    if (xTaskCreate(rc_evt_task_fn, APP_TASK_NAME_EVT, RC_EVT_STACK_WORDS, NULL, RC_TASK_PRIO_EVT,
                    &s_evt_task) != pdPASS) {
        LOG_ERROR("rc: evt task create fail");
        return STATUS_FAIL;
    }
    if (xTaskCreate(rc_tmr_task_fn, APP_TASK_NAME_TMR, RC_TMR_STACK_WORDS, NULL, RC_TASK_PRIO_TMR,
                    &s_tmr_task) != pdPASS) {
        LOG_ERROR("rc: tmr task create fail");
        return STATUS_FAIL;
    }

    LOG_INFO("rc: tasks started");
    return STATUS_OK;
}
